html/ten-rules-for-negotiating-a-job-offer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ten Rules for Negotiating a Job Offer</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Ten Rules for Negotiating a Job Offer</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What it means to “get a job”</a></li>
<li><a href="#sec-2">2. The role of negotiation</a></li>
<li><a href="#sec-3">3. The ten rules of negotiating</a></li>
<li><a href="#sec-4">4. Rule #1 of negotiating: have everything in writing.</a></li>
<li><a href="#sec-5">5. Rule #2 of negotiating: always keep the door open.</a></li>
<li><a href="#sec-6">6. Rule #3 of negotiating: information is power.</a></li>
<li><a href="#sec-7">7. Staying positive is rule #4 of negotiation.</a></li>
<li><a href="#sec-8">8. Rule #5 of negotiation: don’t be the decision-maker.</a></li>
<li><a href="#sec-9">9. Getting other offers</a></li>
<li><a href="#sec-10">10. How to approach exploding offers</a></li>
<li><a href="#sec-11">11. The Negotiating Mindset</a></li>
<li><a href="#sec-12">12. Rule #6 of negotiating is: have alternatives.</a></li>
<li><a href="#sec-13">13. What a Job Negotiation Means to an Employer</a></li>
<li><a href="#sec-14">14. How to Give the First Number</a></li>
<li><a href="#sec-15">15. rule #7: proclaim reasons for everything.</a></li>
<li><a href="#sec-16">16. rule #8: be motivated by more than just money.</a></li>
<li><a href="#sec-17">17. rule #9 is: understand what the company values.</a></li>
<li><a href="#sec-18">18. Rule #10: be winnable.</a></li>
</ul>
</div>
</div>
<p>
part1: <a href="https://medium.freecodecamp.org/ten-rules-for-negotiating-a-job-offer-ee17cccbdab6">https://medium.freecodecamp.org/ten-rules-for-negotiating-a-job-offer-ee17cccbdab6</a>
</p>

<p>
part2: <a href="https://medium.freecodecamp.com/how-not-to-bomb-your-offer-negotiation-c46bb9bc7dea">https://medium.freecodecamp.com/how-not-to-bomb-your-offer-negotiation-c46bb9bc7dea</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What it means to “get a job”</h2>
<div class="outline-text-2" id="text-1">
<p>
求职也可以认为是双方之间的劳动力买卖。就像买商品一样，不可能别人出什么价就给什么价，至少要货比三家吧。
</p>

<p>
Employment is just striking a mutual deal in the labor market.
</p>

<p>
Like any market, the labor market only functions well if it’s competitive. This is the only way to ensure fair and equitable pricing. Imagine you were a farmer selling watermelons. Would you just sell your watermelons to the first buyer who agreed to purchase them? Or would you survey the marketplace of buyers, see the best price (and business partner) you could get, and then make an informed decision on which buyer to sell to?
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The role of negotiation</h2>
<div class="outline-text-2" id="text-2">
<p>
协商是达成交易的过程中一个非常自然的部分，所以不会有人因为你协商而怪你。
</p>

<p>
Negotiating is a natural and expected part of the process of trying to make a deal. It’s also a signal of competence and seriousness. Companies generally respect candidates who negotiate, and most highly attractive candidates negotiate (if for no other reason, because they often have too many options to choose from).
</p>

<p>
At the risk of spouting truisms: always, always negotiate. It doesn’t matter how good or bad you think you are. You never damage a relationship by negotiating.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The ten rules of negotiating</h2>
<div class="outline-text-2" id="text-3">
<p>
总结下来的十条原则：
</p>
<ul class="org-ul">
<li>Get everything in writing（各种条件最好都记录下来）
</li>
<li>Always keep the door open（永远保持开放状态，不要commit）
</li>
<li>Information is power（对自己的信息要保管好）
</li>
<li>Always be positive（保持积极的态度，不管是对现在的公司，还是正在谈的公司）
</li>
<li>Don’t be the decision maker（不要做决策制定者，不要让自己一个人承担压力）
</li>
<li>Have alternatives（保持备选项）
</li>
<li>Proclaim reasons for everything（对所有事情找到一个可以解释的原因）
</li>
<li>Be motivated by more than just money（除了钱之外还要找其他动力）
</li>
<li>Understand what they value（了解他们所需要的人）
</li>
<li>Be winnable（？？我理解这点是，自己要有意向去这个公司，不要play games)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Rule #1 of negotiating: have everything in writing.</h2>
<div class="outline-text-2" id="text-4">
<p>
The rule from here on out is that everything significant you discuss will have some kind of a paper trail. Often, the company won’t even send you an official offer letter until a deal is finalized. So it falls to you to confirm all of the important details in subsequent e-mails.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Rule #2 of negotiating: always keep the door open.</h2>
<div class="outline-text-2" id="text-5">
<p>
在自己完全确定之前，不要将自己承诺给某个offer，保持自己的机会优势。虽然recuriter会不断地push你尽可能地早的完成决定，但是不要在这种压力下面屈服。
</p>

<blockquote>
<p>
Your recruiter will now say something along the lines of “so what do you think?”
</p>

<p>
This seems innocuous, but your reply here is critical, because there’s a lot you can say to weaken your position. This is your first decision point.
</p>

<p>
A decision point is a moment in the negotiation where your interlocutor wants to compel you to make a decision. If they succeed in tying you to a position, they will close the door on further negotiating. Of course “what do you think?” is a subtle prod. But it is the beginning of many attempts to get you to make a premature commitment.
</p>

<p>
Never give up your negotiating power until you’re absolutely ready to make an informed, deliberate final decision.
</p>

<p>
This means your job is to traverse as many of these decision points as possible without giving up the power to continue negotiating. Very frequently, your interlocutor will try to trick you into making a decision, or tie you to a decision you didn’t commit to. You must keep verbally jiu-jitsu-ing out of these antics until you’re actually ready to make your final decision.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Rule #3 of negotiating: information is power.</h2>
<div class="outline-text-2" id="text-6">
<p>
下面是典型的两种错误回复：
</p>
<ol class="org-ol">
<li>直接接收offer
</li>
<li>亮出自己的底价
</li>
</ol>

<blockquote>
<p>
There’s an uncomfortable silence by now, and their “what do you think?” is hanging in the air.
</p>

<p>
If you say “yes, that sounds amazing, when do I start?” you implicitly accept the offer and completely close the door on the negotiation. This is your recruiter’s number one favorite thing to hear. It stands to reason you probably shouldn’t do this.
</p>

<p>
But their second favorite thing to hear you say is “can you do 90K instead of 85K?” This also closes the door, but for a different and more subtle reason. And it’s the number one reason why most people suck at negotiation.
</p>
</blockquote>

<p>
无论如何这两种行为都是暴露自己的位置，让自己在协商中处于不利的地位。现在的猎头可能在招聘一个重要的人员之前已经从很多渠道了解到这个人的基本情况（比如工作时间，当前薪资，曾经担任的职位等等），除非你对这个公司也有很深入的了解，否则在信息对称上来说，你是处于不利的地位的。不过即便如此，还是有很多信息猎头是没有办法知道的，所以这些信息你一定要保护好，因为他是协商的砝码。
</p>

<blockquote>
<p>
To protect your power in the negotiation, you must protect information as much as possible.
</p>

<p>
A company doesn’t give you insight into what it’s thinking. It doesn’t tell you its price range, how much it paid the previous candidate with your experience, or anything like that. It intentionally obfuscates those things. But it wants you not to do the same.
</p>

<p>
A company wants to be like a bidder in a secret auction. But unlike the other bidders, it wants to know exactly how high all of the other bids are. It then openly intends to exploit that knowledge, often by bidding one cent more than the second highest bid.
</p>

<p>
Yeah, no. Screw that. It’s a silent auction, and to keep it that way, you must protect information.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Staying positive is rule #4 of negotiation.</h2>
<div class="outline-text-2" id="text-7">
<p>
无论最后协商的结果如何，你都需要对公司保持积极的态度，愿意来这家公司工作，而不是带着消极情绪来的。
</p>

<blockquote>
<p>
A company is making you an offer because they think you’ll do hard work for them if they pay you. If you lose your excitement for the company during the interview process, then they’ll lose confidence that you’ll actually want to work hard or stay there for a long time. Each of those makes you less attractive as an investment. Remember, you are the product! If you become less excited, then the product you’re selling actually loses value.
</p>

<p>
So despite whatever is happening in the negotiation, give the company the impression that 1) you still like the company, and that 2) you’re still excited to work there, even if the numbers or the money or the timing is not working out. Generally the most convincing thing to signal this is to reiterate you love the mission, the team, or the problem they’re working on, and really want to see things work out.
</p>
</blockquote>
</div>
</div>
