src/ten-rules-for-negotiating-a-job-offer.org
** Rule #5 of negotiation: don’t be the decision-maker.

怎么说呢？即便是最坏的事情发生了，你也可以不是需要负责的人，而是其他与这个面试不相关的decision maker.

#+BEGIN_QUOTE
Even if you don’t particularly care what your friends/family/husband/mother thinks, by mentioning them, you’re no longer the only person the recruiter needs to win over. There’s no point in them trying to bully and intimidate you; the “true decision-maker” is beyond their reach.

This is a classic technique in customer support and remediation. It’s never the person on the phone’s fault, they’re just some poor schmuck doing their job. It’s not their decision to make. This helps to defuse tension and give them more control of the situation.

It’s much harder to pressure someone if they’re not the final decision-maker. So take advantage of that.
#+END_QUOTE

** Getting other offers

手中同时拥有几份offer对于自己加码会更加有利。这点非常容易理解，文章对这个原因也做了深入分析。

#+BEGIN_QUOTE
The truth is, knowing that someone has passed your interview just doesn’t say that much about whether they’ll be a good employee. It’s as though you knew nothing about a student other than their SAT score. It’s just not a lot of data to go off.

Nobody has solved this problem. Not Google nor anyone else.

And this is precisely why it’s rational for companies to care that you’ve received other offers. They care because each company knows that their own process is noisy, and the processes of most other companies are also noisy. But a candidate having multiple offers means that they have multiple weak signals in their favor. Combined, these converge into a much stronger signal than any single interview. It’s like knowing that a student has a strong SAT score, and GPA, and won various scholarships. Sure, it’s still possible that they’re a dunce, but it’s much harder for that to be true.
#+END_QUOTE


** How to approach exploding offers

对于exploding offers, 方法是保持礼貌的态度，表达自己需要时间来进行决定。可能对于他们来说，exploding offer类似于一种态度和傲娇（我认为我们公司非常牛，所以我们发出的offer都是exploding offer, take it or not)，他们会不断地强化这点。你不能对这种exploding offer置之不理，对大家都没有好处，最好的方式就是表达自己的意愿，需要延长offer的时间。

** The Negotiating Mindset

尝试从各种角度来最大化双方的利益

#+BEGIN_QUOTE
Do not fall into the trap of valuing companies solely along one dimension. That means don’t just value companies based on salary, equity, or even on prestige. Those are all important dimensions, but so are cultural fit, the challenge of the work, learning potential, later career options, quality of life, growth potential, and just overall happiness. None of these inherently trump any of the other. Anyone who tells you “just choose wherever you think you’ll be happiest” is being just as simplistic as someone who says “just choose the one that offers the most money.” All of these things matter, and your decision should be genuinely multi-dimensional.

The more companies you talk to, the more likely you are to find a company to which you are significantly more valuable than the rest. Chances are this is where you’ll be able to negotiate your strongest offer. It might surprise you which company this turns out to be; keep an open mind, and remember that a job search is a 2-sided process.

One of the most valuable things you can do for yourself in this process is to really try to understand how employers think and what motivates them. Understanding your interlocutor is extremely important in negotiation, and we’ll be exploring that a lot in the next blog post.
But most of all I want to emphasize: be curious about the other side. Try to understand why employers think the way they do. Be sympathetic toward them. Care about what they want and help them try to get it. Adopting this mindset will make you a much stronger negotiator, and accordingly, a much better employee and team member.

#+END_QUOTE

一个job offer在福利上可能有下面这些，所以不要从单一的维度来协商：
- salary
- signing bonuses
- stock
- year-end or performance bonuses
- commuter benefits
- relocation expenses
- equipment
- an educational stipend
- a childcare stipend
- extra vacation time
- a later start date
- getting a dedicated hour a day to work out or study or meditate or play solitaire.

** Rule #6 of negotiating is: have alternatives.

alternatives除了其他公司的offers之外，还意味着其他的可能性，比如是进入学校等等。另外注意，你现阶段的工作可能也是你的best alternative, 因为不接受这份offer你可以还继续呆在这个单位。

#+BEGIN_QUOTE
Note: one of the biggest mistakes I see here is from people who are currently working. If you already have a job, staying where you are is often your BATNA.

This means if you tell your interlocutor that you hate your job, then they know your BATNA sucks, and have no incentive to negotiate with you (on top of potentially thinking that you’re a negative person). Always emphasize the pros of your current company, your seniority, your impact, and whatever else you like about where you currently work.

You should make your decision seem like a genuinely difficult one — then it will appear to be a strong BATNA.
#+END_QUOTE

** What a Job Negotiation Means to an Employer

Job协商成本非常高，所以你也要利用好这个优势，他们不太可能因为你协商而就直接fail你，考虑到招聘成本问题。

** How to Give the First Number

当对方要你给出报价时，尽量把这个报价先丢给对方，以免透露出自己的低价。如果对方一定要你给出范围的话，

#+BEGIN_QUOTE
“Well, okay. I know that the average software engineer in Silicon Valley makes roughly 120K a year in salary. So I think that’s a good place to start.”
#+END_QUOTE

给出业界报价，但是留有余地。

** rule #7: proclaim reasons for everything.

很多人不想表现出贪婪，但是有时候，尤其是在这个时候必须表现出。我们可以为他们找一个合理的理由。

#+BEGIN_QUOTE
I suspect this is the primary reason why so many candidates recoil from negotiating. They don’t want to feel greedy. It goes against all of their social conditioning. And yet, there are some situations in which most people would be totally fine negotiating.

Specifically, when they have to.

If you had to raise your salary or you wouldn’t be able to afford rent, or if you had to negotiate health insurance to cover a medical condition, you’d negotiate without a twinge of regret. The difference? That you have a reason for what you’re requesting.

It’s kind of a brain-hack, both for yourself and for your negotiating partner. Just stating a reason — any reason — makes your request feel human and important. It’s not you being greedy, it’s you trying to fulfill your goals.
#+END_QUOTE

** rule #8: be motivated by more than just money.

#+BEGIN_QUOTE
Actually be motivated by other things. You should be motivated by money, too, of course, but it should be one among many dimensions you’re optimizing for. How much training you get, what your first project will be, which team you join, or even who your mentor will be — these are all things you can and should negotiate.
#+END_QUOTE


