src/ten-rules-for-negotiating-a-job-offer.org
** rule #9 is: understand what the company values.

公司不太可能从在工资上给你增加的时候，可以尝试从其他方面增加比如奖金或者是股票，又或者是休假时间等，还可以是工作的团队，都是不错的选择。

#+BEGIN_QUOTE
salary is almost always the hardest thing to give, for a few reasons:
- It must be paid year after year, so it becomes part of a company’s long-term burn rate.
- It is almost always the thing that people gossip about, so paying someone significantly more salary can cause unrest.
- It tends to be the most tightly constrained by pay bands, especially at large companies.

So if you want more financial compensation, you should think about structuring as much of it as possible outside of salary. A signing bonus, for example, is easier to give than salary. A signing bonus has the advantage of only needing to be paid once. It gets the candidate excited about joining (because everyone likes wads of cash), and it’s generally not as public.
#+END_QUOTE

** Rule #10: be winnable.

#+BEGIN_QUOTE
This is more than just giving the company the impression that you like them (which you continually should). But more so that you must give any company you’re talking to a clear path on how to win you. Don’t BS them or play stupid games. Be clear and unequivocal with your preferences and timeline.

If there is nothing that a company could do to sign you, or you don’t actually want to work for them, then don’t negotiate with them. Period.

Don’t waste their time or play games for your own purposes. Even if the company isn’t your dream company, you must be able to imagine at least some package they could offer you that would make you sign. If not, politely turn them down.

It costs each company money to interview you and to negotiate with you. I didn’t negotiate with every company I received an offer from, but if there was one key mistake I made in my job search, it was that I still negotiated with too many (in large part because I didn’t think my job search would be successful).
#+END_QUOTE
