html/ten-rules-for-negotiating-a-job-offer.html


<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> rule #9 is: understand what the company values.</h2>
<div class="outline-text-2" id="text-17">
<p>
公司不太可能从在工资上给你增加的时候，可以尝试从其他方面增加比如奖金或者是股票，又或者是休假时间等，还可以是工作的团队，都是不错的选择。
</p>

<blockquote>
<p>
salary is almost always the hardest thing to give, for a few reasons:
</p>
<ul class="org-ul">
<li>It must be paid year after year, so it becomes part of a company’s long-term burn rate.
</li>
<li>It is almost always the thing that people gossip about, so paying someone significantly more salary can cause unrest.
</li>
<li>It tends to be the most tightly constrained by pay bands, especially at large companies.
</li>
</ul>

<p>
So if you want more financial compensation, you should think about structuring as much of it as possible outside of salary. A signing bonus, for example, is easier to give than salary. A signing bonus has the advantage of only needing to be paid once. It gets the candidate excited about joining (because everyone likes wads of cash), and it’s generally not as public.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Rule #10: be winnable.</h2>
<div class="outline-text-2" id="text-18">
<blockquote>
<p>
This is more than just giving the company the impression that you like them (which you continually should). But more so that you must give any company you’re talking to a clear path on how to win you. Don’t BS them or play stupid games. Be clear and unequivocal with your preferences and timeline.
</p>

<p>
If there is nothing that a company could do to sign you, or you don’t actually want to work for them, then don’t negotiate with them. Period.
</p>

<p>
Don’t waste their time or play games for your own purposes. Even if the company isn’t your dream company, you must be able to imagine at least some package they could offer you that would make you sign. If not, politely turn them down.
</p>

<p>
It costs each company money to interview you and to negotiate with you. I didn’t negotiate with every company I received an offer from, but if there was one key mistake I made in my job search, it was that I still negotiated with too many (in large part because I didn’t think my job search would be successful).
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>
